#+TITLE:     The Tempo of Change in the Leeward Kohala Field System, Hawai`i Island
#+AUTHOR:    Thomas S. Dye
#+EMAIL:     tsd@tsdye.com
#+DATE:
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+STARTUP: overview
#+FILETAGS: RESEARCH
#+STYLE: <link rel="stylesheet" type="text/css" href="http://www.tsdye.com/tsd.css" />
#+LaTeX_CLASS: koma-article
#+LaTeX_CLASS_OPTIONS: [listof=flat,letterpaper,11pt,abstract=true]
#+LaTeX_HEADER: \usepackage[AUTO]{inputenc}
#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage[adobe-utopia]{mathdesign}
#+LaTeX_HEADER: \usepackage[scaled]{berasans}
#+LaTeX_HEADER: \usepackage[scaled]{beramono}
#+LaTeX_HEADER: \usepackage[style=authoryear-comp,natbib=true]{biblatex}
#+LaTeX_HEADER: \bibliography{tempo}
#+LaTeX_HEADER: \usepackage{graphicx}
#+LaTeX_HEADER: \setcounter{tocdepth}{1}
#+LaTeX_HEADER: \setcounter{secnumdepth}{1}
#+LaTeX_HEADER: \usepackage{microtype}
#+LaTeX_HEADER: \newcommand{\rc}{\ensuremath{^{14}}{C}}
#+LaTeX_HEADER: \usepackage{paralist}
#+LaTeX_HEADER: \renewenvironment{enumerate}{\begin{inparaenum}[(i)]}{\end{inparaenum}}
#+LaTeX_HEADER: \let\description\compactdesc
#+LaTeX_HEADER: \let\itemize\compactitem
#+LaTeX_HEADER: \let\latin\textit
#+LaTeX_HEADER: \let\era\textsc
#+LaTeX_HEADER: \newcounter{tsd@fn}
#+LaTeX_HEADER: \newcommand{\fn}[1]{\setcounter{tsd@fn}{#1}\textsuperscript{\fnsymbol{tsd@fn}}}
#+LaTeX_HEADER: \usepackage{booktabs}
#+LaTeX_HEADER: \usepackage{textcomp,latexsym}
#+LaTeX_HEADER: \usepackage{tabularx}
#+LaTeX_HEADER: \usepackage[x11names]{xcolor}
#+LaTeX_HEADER: \usepackage[colorlinks=true,urlcolor=SteelBlue4,linkcolor=Firebrick4,citecolor=Green4]{hyperref}

* \rc\space Dating of Field System Features

Table \ref{tab:dates} lists 21 of the 25 \rc\space age determinations
associated with agricultural features in Leeward Kohala Field System
published by [[textcite:ladefoged08:_variab_hawaii][Table 1;]].  It
includes all 17 \rc\space age determinations from the detailed study
area at P\=ahinahina and Kahua 1, along with four of the eight
\rc\space age determinations from features outside the detailed study
area.  All of the age determinations in the table are on short-lived
materials.  The four excluded \rc\space age determinations are on
materials identified as dicot wood.  They were excluded because of the
potential in-built age carried by this material.  The \rc\space age
determinations all derive from archaeological contexts that "date
activities that occurred before the construction of the agricultural
walls" or that "pre-date the construction of the trails"
[[parencite:ladefoged08:_variab_hawaii][778;]].

#+begin_src latex :exports results :results latex
  \begin{table}[htb!]
    \centering
    \footnotesize
    \caption{\rc\ age determinations}
    \label{tab:dates}
    <<booktabs-notes(table=dates,notes=dates-fn,lspace=t,align="rcrlcrr",env="tabular")>>  
  \end{table}
#+end_src

#+results:
#+BEGIN_LaTeX
\begin{table}[htb!]
  \centering
  \footnotesize
  \caption{\rc\ age determinations}
  \label{tab:dates}
  
    \begin{tabular}{rcrlcrr}
    \toprule
    $\theta$\fn{1} & Feature\fn{2} & Group\fn{3} & Beta- & CRA\fn{4} & Outlier & KRC-\fn{5} \\
  \midrule
  8 & i & 1 & 189729 & 290 $\pm$ 40 & -2\% & 1 \\
  9 & j & 1 & 189730 & 440 $\pm$ 40 & 6\% & 2 \\
  10 & k & 1 & 189731 & 420 $\pm$ 40 & 2\% & 3 \\
  11 & c & 1 & 208141 & 200 $\pm$ 40 & 20\% & 22 \\
  12 & e & 3 & 208138 & 320 $\pm$ 40 & 5\% & 19 \\
  13 & f & 3 & 208139 & 160 $\pm$ 40 & -3\% & 20 \\
  14 & e & 3 & 208140 & 150 $\pm$ 40 & -3\% & 21 \\
  15 & l & 5a & 189732 & 210 $\pm$ 40 & 1\% & 4 \\
  16 & a & 5a & 208142 & 340 $\pm$ 40 & -3\% & 23 \\
  17 & d & 5b & 189734 & 250 $\pm$ 40 & 3\% & 6 \\
  18 & g & 5b & 189735 & 410 $\pm$ 40 & 3\% & 7 \\
  19 & p & garden & 189740 & 330 $\pm$ 40 & n/a & 12 \\
  20 & q & garden & 189741 & 150 $\pm$ 30 & n/a & 13 \\
  21 & o & garden & 189742 & 130 $\pm$ 30 & n/a & 14 \\
  22 & B & 2 & 189733 & 130 $\pm$ 30 & -1\% & 5 \\
  23 & C & 4 & 189736 & 140 $\pm$ 30 & -3\% & 8 \\
  24 & F & garden & 189743 & 210 $\pm$ 40 & n/a & 15 \\
  25 & T-12 & garden & 189737 & 470 $\pm$ 40 & n/a & 9 \\
  26 & T-21 & garden & 189745 & 460 $\pm$ 40 & n/a & 17 \\
  27 & T-22 & garden & 206590 & 280 $\pm$ 40 & n/a & 18 \\
  28 & T-50 & garden & 208143 & 580 $\pm$ 40 & n/a & 24 \\
    \bottomrule\addlinespace
    \multicolumn{7}{l}{\fn{1} See \url{http://www.tsdye.com/research/tempo.html}.} \\
  \multicolumn{7}{l}{\fn{2} See Figure~\ref{fig:diagram}.} \\
  \multicolumn{7}{l}{\fn{3} See Figure~\ref{fig:digraph} and \url{http://www.tsdye.com/research/tempo.html}.} \\
  \multicolumn{7}{l}{\fn{4} Conventional \rc\ age \parencite{stuiver-polach77}.} \\
  \multicolumn{7}{l}{\fn{5} Source: \textcite{ladefoged08:_variab_hawaii}.} \\
    \end{tabular}
    
\end{table}
#+END_LaTeX


Table \ref{tab:dates} provides the label assigned to the age
determination by [[textcite:ladefoged08:_variab_hawaii]] in the last
column, the label assigned by the dating laboratory in column 4, the
wall or trail feature with which the age determination is associated,
keyed to Figure \ref{fig:diagram}, in column 2, and the calibration
group to which the determination has been assigned in column 3.  The
values in the first column, labeled \theta, identify the age
determinations in the Bayesian analysis. Technically, in the Bayesian
model each \theta represents the true calendar age of the sample,
which is estimated by the corresponding \rc\space age determination.
The values in the table start with \theta_8 and run through \theta_28.
This is because the field system calibration is carried out in the
context of an estimate of when the islands were initially colonized by
Polynesians, which requires seven age determinations assigned to
\theta_{1 \dots 7} [[parencite:dyess:_model_age_estim_polyn_colon_hawaii][;]].  The column labeled "Outlier" is an analytic result, discussed
below.

A striking feature of Table \ref{tab:dates} is that most of the
\rc\space age determinations are relatively young.  This is the case
even for \rc\space age determinations associated with the oldest
features in the detailed study area.  Two of the \rc\space age
determinations associated with Group 1 walls are less than 300
\rc\space years old, and the youngest of these, associated with wall
/c/, dates to 200 \pm 40 BP.  The sample collected from beneath the
curbstone of the oldest trail, trail /B/, dates to 130 \pm 30 BP.
Keeping in mind that these \rc\space age determinations pre-date
construction of the associated features, and that the field system was
abandoned "within a few decades following European contact"
[[parencite:kirch10:_how_chief_becam_kings][153;]], or about 100 BP, it
would appear that most of the features in the detailed study area were
built within the span of about 100 \rc\space years.

Because a 100 \rc\space year span seems too brief for construction of
the field system facilities, an analysis was performed to identify
outliers among the \rc\space age determinations
[[parencite:christen94:_summar_set_of_radioc_deter]].  The expectation was
that the young age determinations associated with the oldest features
would be identified as outliers and could be removed from the
calibration.  The results of the outlier analysis are presented in
column 6 of Table \ref{tab:dates} as the difference between an
uninformative prior probability assigned to each \rc\space age
determination and the posterior probability returned by the analysis.
Negative numbers indicate \rc\space age determinations that are less
likely to be outliers than was estimated by the prior probability and
positive numbers indicate \rc\space age determinations that are more
likely to be outliers.  The outlier identification procedure doesn't
establish a metric for how big this difference must be for a \rc\space
age determination to be considered an outlier.  In practice, the
analyst uses the results to draw attention to particular \rc\space age
determinations and these are scrutinized as necessary before a
decision is made either to keep them in the analysis or discard them
as outliers.

The results of the outlier analysis indicate that there is no reason
to question the integrity of most of the age determinations.  The
young age determination from under the curbstone of trail /B/ and the
age determination associated with wall /i/ in Group 1 are not
outliers.  The only age determination possibly indicated by the
analysis as an outlier is the age determination associated with wall
/c/.  [[textcite:ladefoged08:_variab_hawaii][779;]] don't discuss this
particular age determination and it appears not to have played a role
in their interpretation of the dating results.  However, there are
several reasons why this age determination should not be treated as
an outlier:
   1. the dating model typically has few age determinations per group
      and this makes outlier determination less reliable than it would
      be with more samples;
   2. the result returned by the outlier analysis is not particularly
      strong---the prior probability of 0.1 increased to 0.3, about a
      quarter of the possible maximum;
   3. the \rc\space age determination is only 90 \rc\space years
      younger than the next youngest sample from beneath a Group 1
      wall;
   4. the \rc\space age determination associated with the feature
      immediately younger than it, trail /B/, is stratigraphically
      correct and about 70 \rc\space years younger than it; and
   5. charcoal from the later swidden activities might be relatively
      rare if, as appears to be the case, secondary growth
      were consistently used as a source of mulch, or if burned
      secondary growth consisted mostly of grasses [[parencite:kirch10:_how_chief_becam_kings][53;]].  
On balance, then, there appears to be no compelling reason to discard
this age determination as an outlier.  However, this is an issue that
might repay identification and dating of additional samples from
beneath Group 1 walls.

** Source

#+tblname: adj-lkfs
|   | A | B | C | D | E | F | G | a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q |
| A |   |   |   |   |   |   |   | 1 |   |   |   |   |   |   |   |   |   |   | 1 |   |   |   |   |   |
| B |   |   |   |   |   |   |   |   |   |   | 1 | 1 | 1 | 1 | 1 |   |   |   | 1 |   |   |   |   |   |
| C |   |   |   |   |   |   |   |   | 1 |   | 1 |   |   | 1 |   |   |   |   |   |   |   |   |   |   |
| D |   |   |   |   |   |   |   |   | 1 |   |   |   |   |   |   |   |   |   |   |   | 1 |   |   |   |
| E |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| F |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   | 1 |   |   |   |   |
| G |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   | 1 |   |
| a |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| b |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| c | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| d |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| e | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| f | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| g |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| h |   |   | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| i | 1 | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| j | 1 | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| k | 1 | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| l |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| m |   |   |   | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| n |   |   |   |   | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| o |   |   |   |   | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| p |   |   |   |   | 1 | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| q |   |   |   |   | 1 |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |

#+tblname: lkfs-attrib
|   | dated | symbol | group |
| A |       | box    |       |
| B | yes   | box    |     2 |
| C | yes   | box    |     4 |
| D |       | box    |       |
| E |       | box    |       |
| F | yes   | box    |       |
| G |       | box    |       |
| a | yes   |        |    5a |
| b |       |        |       |
| c | yes   |        |     1 |
| d | yes   |        |    5b |
| e | yes   |        |     3 |
| f | yes   |        |     3 |
| g | yes   |        |    5b |
| h |       |        |       |
| i | yes   |        |     1 |
| j | yes   |        |     1 |
| k | yes   |        |     1 |
| l | yes   |        |    5a |
| m |       |        |       |
| n |       |        |       |
| o | yes   |        |       |
| p | yes   |        |       |
| q | yes   |        |       |





   It might be possible to indicate the groups with subgraphs.  I should
   probably pass in two variables, one with the adjacency graph and the
   other with layout attributes.

#+source: dot-digraph
#+header: :var width=6 :var height=4
#+header: :var a=adj-lkfs
#+header: :var b=lkfs-attrib
#+begin_src python :results output :exports none
  import string
  print 'Digraph G {'
  print 'size = "%s,%s";' %(width,height)
  sg = {}
  for i in range(len(b)):
    if b[i][2] and b[i][2] == 'box':
      print '%s [shape=box];' % b[i][0]
    if b[i][1] == 'yes':
        print '%s [style=filled, fillcolor = "lightgrey"];' % b[i][0]
    if b[i][3] and i > 0:
      if b[i][3] in sg.keys():
        s = sg[b[i][3]]
        s = s + '%s; ' % b[i][0]
        sg[b[i][3]] = s
      else:
        sg[b[i][3]] = '%s; ' % b[i][0]
  for k, v in sg.iteritems():
    print 'subgraph cluster_%s {' % k
    print '    node [style=filled];'
    print '    %s' % v
    print '    label = "Group %s";' % k
    print '  }'

  for i in range(len(a)):
    for j in range(len(a[i])):
      if a[i][j] == 1:
        print '%s -> %s;' % (a[i][0],a[0][j])
  print '}'

#+end_src

#+results: dot-digraph
#+begin_example
   Digraph G {
   size = "6,4";
   A [shape=box];
   B [shape=box];
   B [style=filled, fillcolor = "lightgrey"];
   C [shape=box];
   C [style=filled, fillcolor = "lightgrey"];
   D [shape=box];
   E [shape=box];
   F [shape=box];
   F [style=filled, fillcolor = "lightgrey"];
   G [shape=box];
   a [style=filled, fillcolor = "lightgrey"];
   c [style=filled, fillcolor = "lightgrey"];
   d [style=filled, fillcolor = "lightgrey"];
   e [style=filled, fillcolor = "lightgrey"];
   f [style=filled, fillcolor = "lightgrey"];
   g [style=filled, fillcolor = "lightgrey"];
   i [style=filled, fillcolor = "lightgrey"];
   j [style=filled, fillcolor = "lightgrey"];
   k [style=filled, fillcolor = "lightgrey"];
   l [style=filled, fillcolor = "lightgrey"];
   o [style=filled, fillcolor = "lightgrey"];
   p [style=filled, fillcolor = "lightgrey"];
   q [style=filled, fillcolor = "lightgrey"];
   subgraph cluster_1 {
   node [style=filled];
   c; i; j; k;
   label = "Group 1";
   }
   subgraph cluster_2 {
   node [style=filled];
   B;
   label = "Group 2";
   }
   subgraph cluster_3 {
   node [style=filled];
   e; f;
   label = "Group 3";
   }
   subgraph cluster_4 {
   node [style=filled];
   C;
   label = "Group 4";
   }
   subgraph cluster_5a {
   node [style=filled];
   a; l;
   label = "Group 5a";
   }
   subgraph cluster_5b {
   node [style=filled];
   d; g;
   label = "Group 5b";
   }
   A -> a;
   A -> l;
   B -> d;
   B -> e;
   B -> f;
   B -> g;
   B -> h;
   B -> l;
   C -> b;
   C -> d;
   C -> g;
   D -> b;
   D -> n;
   F -> m;
   G -> p;
   c -> A;
   c -> B;
   e -> A;
   f -> A;
   h -> C;
   i -> A;
   i -> B;
   i -> C;
   j -> A;
   j -> B;
   j -> C;
   k -> A;
   k -> B;
   k -> C;
   m -> D;
   m -> E;
   n -> E;
   o -> E;
   p -> E;
   p -> F;
   q -> E;
   }
#+end_example


#+source: trans-red
#+begin_src sh :var body=dot-digraph :results output
echo $body > dot-temp.gv
tred dot-temp.gv > dot-temp-tred.gv
cat dot-temp-tred.gv
rm dot-temp-tred.gv
#+end_src

#+results: trans-red
#+begin_example
   digraph G {
   graph [size="6,4"];
   subgraph cluster_1 {
   graph [label="Group 1"];
   node [style=filled];
   c             [fillcolor=lightgrey,
   style=filled];
   i             [fillcolor=lightgrey,
   style=filled];
   j             [fillcolor=lightgrey,
   style=filled];
   k             [fillcolor=lightgrey,
   style=filled];
   }
   subgraph cluster_2 {
   graph [label="Group 2"];
   node [style=filled];
   B             [fillcolor=lightgrey,
   shape=box,
   style=filled];
   }
   subgraph cluster_3 {
   graph [label="Group 3"];
   node [style=filled];
   e             [fillcolor=lightgrey,
   style=filled];
   f             [fillcolor=lightgrey,
   style=filled];
   }
   subgraph cluster_4 {
   graph [label="Group 4"];
   node [style=filled];
   C             [fillcolor=lightgrey,
   shape=box,
   style=filled];
   }
   subgraph cluster_5a {
   graph [label="Group 5a"];
   node [style=filled];
   a             [fillcolor=lightgrey,
   style=filled];
   l             [fillcolor=lightgrey,
   style=filled];
   }
   subgraph cluster_5b {
   graph [label="Group 5b"];
   node [style=filled];
   d             [fillcolor=lightgrey,
   style=filled];
   g             [fillcolor=lightgrey,
   style=filled];
   }
   A     [shape=box];
   A -> a;
   A -> l;
   B -> e;
   B -> f;
   B -> h;
   C -> d;
   C -> g;
   C -> b;
   D     [shape=box];
   D -> b;
   D -> n;
   E     [shape=box];
   F     [fillcolor=lightgrey,
   shape=box,
   style=filled];
   F -> m;
   G     [shape=box];
   p     [fillcolor=lightgrey,
   style=filled];
   G -> p;
   c -> B;
   e -> A;
   f -> A;
   i -> B;
   j -> B;
   k -> B;
   o     [fillcolor=lightgrey,
   style=filled];
   o -> E;
   p -> F;
   q     [fillcolor=lightgrey,
   style=filled];
   q -> E;
   h -> C;
   n -> E;
   m -> D;
   }
#+end_example

#+source: make-dag
#+headers: :file lkfs-dag.pdf :cmdline -Tpdf
#+begin_src dot :var v=trans-red :results output
    $v
#+end_src


